Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetLineContainment(Autodesk.AutoCAD.Geometry.LinearEntity3d,System.Int32)
Determines whether a line lies inside or outside the current object's topological boundary.
line:  Input 3D line
numHitsWanted:  Input maximum number of hits to find

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double)
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate.
density:  Input calculating density

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double)
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate.
density:  Input calculating density
tolRequired:  Input tolerance needed for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetVolume
This function returns the volume of this topology object as a double, with the maximum scale factor applied for the nested transforms.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetVolume(System.Double)
This function returns the volume of this topology object as a double, with the maximum scale factor applied for the nested transforms.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetSurfaceArea
This function returns the surface area of this topology object as a double, with the maximum scale factor applied from the nested transformations.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double)
This function returns the surface area of this topology object as a double, with the maximum scale factor applied from the nested transformations.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetPerimeterLength
This function returns the perimeter length of this topology object, with the maximum scale factor applied from the nested transformations.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double)
This function returns the perimeter length of this topology object, with the maximum scale factor applied from the nested transformations.
tolRequired:  Input tolerance requested for the calculation