Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetCurveAsNurb
This function returns the the edge's underlying curve.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetCurveAsNurb(System.Double)
This function returns the the edge's underlying curve.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetCurveAsNurb(System.Double,System.Double&)
This function returns the the edge's underlying curve.
tolRequired:  Input tolerance requested for the calculation
tolAchieved:  Output tolerance achieved for the calculation