Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsTrimmedNurbs
The GetSurfaceAsTrimmedNurbs() model space trimmed surface query converts this face's underlying surface to a trimmed representation.

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetArea
This function calculates the area of the face.

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetArea(System.Double)
This function calculates the area of the face.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsNurb
This function returns this face's underlying surface as a subset NurbSurface, with the entire chain of transforms from the subentity path applied.

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsNurb(System.Double)
This function returns this face's underlying surface as a subset NurbSurface, with the entire chain of transforms from the subentity path applied.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsNurb(System.Double,System.Double&)
This function returns this face's underlying surface as a subset NurbSurface, with the entire chain of transforms from the subentity path applied.
tolRequired:  Input tolerance requested for the calculation
tolAchieved:  Output tolerance achieved for the calculation