Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.ValidationLevel
Accesses the validation level to be used in all data queries that require access to the associated AutoCAD object.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.EntityAssociated
Accesses the dimensionally lowest topology object associated with this mesh object.