Autodesk.AutoCAD.BoundaryRepresentation.Hit.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.EntityHit
Accesses the dimensionally lowest topological entity that contains this hit.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.ValidationLevel
Accesses the validation level to be used in all data queries that require access to the associated AutoCAD object.