Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dFilter
This .NET class wraps the AcBrMesh2dFilter ObjectARX class.The Mesh2dFilter class is the interface class for 2d mesh filters.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dFilter.Insert(Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity,Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dControl)
The Insert() function associates a specific 2d mesh control with a topology object, and adds it to the multimap.
brepEntity:  Input topology to associate with
meshControl:  Input mesh 2d control